# Найти произведение пар чисел в списке. Парой считаем первый и последний элемент, второй и предпоследний и т.д. 
# Пример: [2, 3, 4, 5, 6] => [12, 15, 16]; [2, 3, 5, 6] => [12, 15] 
A = input('Введите числа  ').split()
for i in range(len(A)):
    A[i] = int(A[i])
print('Полученный список', A)
j = int ((len(A))-1)

multy = 1
for i in range (int(len(A)/2)):
    multy = A[i]*A[j]
    print(f'первое число:  {A[i]} второе число: {A[j]} произведение: {multy}')
    j = j-1
    
