# 52. Дана последовательность чисел. Получить список неповторяющихся элементов исходной последовательности 
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]

""" a = [1, 2, 3, 5, 1, 5, 3, 10]
res = list(set(a))
print(res)"""

a = [1, 2, 3, 5, 5]
res  = []

for i in a:
    count = 0
    for j in res:
        if i == j: count += 1
    if count == 0: res.append(i)

print(res)



