# 35 Написать программу получающую набор произведений чисел от 1 до N. Пример: пусть N = 4, тогдаn[ 1, 2, 6, 24 ]
n = int(input('Введите n '))
for i  in range(1,n+1):
    
a = [i*(i+1) for i in range(0,n)]
print(a)
