# Написать программу вычисления значения функции y = f(a), напимер y = a*a
def function (a):
    print (a*a)
function (a = int(input('Введите a  ')))
